app/controllers/business_processes_controller.rb

  def index
    @business_processes = BusinessProcess.all
---
SELECT "business_processes".* FROM "business_processes"

  def create
    @business_process = BusinessProcess.new(business_process_params)
    ##
    # @business_process.document = params[:business_process][:document]
    ##
    respond_to do |format|
      if @business_process.save
        format.html { redirect_to @business_process, notice: 'Business process was successfully created.' }
        format.json { render :show, status: :created, location: @business_process }
        route_point = RoutePoint.where(route_id: @business_process.route_id).order(:number)[0]
        if route_point
          Task.create(
            business_process_id: @business_process.id,
            route_id: @business_process.route_id,
            route_point_id: route_point.id,
            performer_id: route_point.performer_id,
            executed: false
            )
---
INSERT INTO "business_processes" ("description", "author_id", "route_id", "file_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "route_points".* FROM "route_points" WHERE "route_points"."route_id" = ? ORDER BY "route_points"."number" ASC  [["route_id", 2]]
INSERT INTO "tasks" ("business_process_id", "executed", "route_id", "route_point_id", "performer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["business_process_id", 1], ["executed", false], ["route_id", 1], ["route_point_id", 1], ["performer_id", 2], ["created_at", 2016-06-27 21:49:51 UTC], ["updated_at", 2016-06-27 21:49:51 UTC]]

  def update
    respond_to do |format|
      if @business_process.update(business_process_params)
---
UPDATE "business_processes" SET "executed" = ?, "updated_at" = ? WHERE "business_processes"."id" = ?  [["executed", false], ["updated_at", 2016-06-27 14:39:39 UTC], ["id", 1]]

  def destroy
    @business_process.destroy
---
DELETE FROM "business_processes" WHERE "business_processes"."id" = $1  [["id", 1]]

    def set_business_process
      @business_process = BusinessProcess.find(params[:id])
---
SELECT  "business_processes".* FROM "business_processes" WHERE "business_processes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]